#Наполнение базы данных

import sqlite3

con = sqlite3.connect("lab2_db.sqlite")

con.executescript('''
insert into Location(location_id, location_name) values
(0, "Москва"),
(1, "Санкт-Петербург"),
(2, "Новосибирск"),
(3, "Екатеринбург"),
(4, "Казань"),
(5, "Нижний Новгород"),
(6, "Челябинск"),
(7, "Самара"),
(8, "Омск"),
(9, "Владивосток");

insert into Vendor(vendor_id, vendor_name, vendor_address, vendor_phone, location_id) values
(0, "ООО Флайтон", "​Проспект Мира, 19 ст; 184-1 офис; 1 этаж, комната 6Б", "8-964-377-63-19", 0),
(1, "Стройпартнер", "2-й Павелецкий проезд, 5 ст1; 5-12 офис; 5 этаж​", "8-495-295-33-11", 0),
(2, "ООО Ксм", "​Маршала Говорова, 35; 208 офис; 2 этаж​", "8-812-313-22-66", 1),
(3, "АЗИЯЛЕСТОРГ", "​Большая, 255; 1А офис​", "8-991-376-23-84", 2),
(4, "ООО Завод строительных материалов", "​Электродепо, 1; 2 этаж​", "8-343-310-95-56", 3),
(5, "ООО Строй-Гипс", "​Тимер Юл, 3", "8-937-771-11-00", 4),
(6, "Sansprin", "​Композитора Касьянова, 6г мод1", "8-831-228-99-99", 5),
(7, "ООО Уральский гранит", "​Академика Королёва, 31; 1 этаж​", "8-908-052-10-34", 6),
(8, "Оптово-розничная компания по продаже пиломат-ов", "​Барабинская, 40а", "8-923-765-95-65", 8),
(9, "ООО РЕЗИНОТЕХНИКА", "​Дальзаводская, 4; 305 павильон; 1 этаж​", "8-423-246-02-13", 9);

insert into Product(product_id, product_name, product_measuring_units, product_amount) values
(0, "Гранит", "м3", 1500),
(1, "Утеплитель базальтовый", "м3", 0),
(2, "Фанера берёзовая", "м3", 5605),
(3, "Фанера дубовая", "м3", 8003),
(4, "Фанера еловая", "м3", 2357),
(5, "Кирпич красный", "м3", 5000),
(6, "Кирпич белый", "м3", 4500),
(7, "Цемент", "шт", 1352),
(8, "Вермикулит", "м3", 7000),
(9, "Изопинк", "м3", 4870),
(10, "Плитка керамическая белая", "шт", 11500),
(11, "Мастика", "шт", 0),
(12, "Брус берёзовый", "м3", 0),
(13, "Брус дубовый", "м3", 0),
(14, "Брус еловый", "м3", 0),
(15, "Брус сосновый", "м3", 0),
(16, "Плитка керамическая жёлтая", "шт", 0),
(17, "Плитка керамическая красная", "шт", 0),
(18, "Плитка керамическая синяя", "шт", 3457),
(19, "Плитка керамическая зелёная", "шт", 0),
(20, "Плитка керамическая чёрная", "шт", 0),
(21, "Плитка керамическая серая", "шт", 8765),
(22, "Гвоздь стальной", "т", 25),
(23, "Гвоздь декоративный", "т", 40),
(24, "Краска силикатная белая", "шт", 2531),
(25, "Краска силикатная коричневая", "шт", 24),
(26, "Краска водоэмульсионная синяя", "шт", 51);

insert into Vendors_Products_List(vendor_id, product_id, product_price_rubles, product_price_copecks) values
(0, 0, 1100, 0),
(0, 1, 500, 0),
(0, 2, 750, 0),
(0, 9, 5400, 0),
(1, 7, 1800, 0),
(1, 0, 1400, 0),
(1, 1, 450, 0),
(2, 5, 3500, 0),
(2, 6, 3300, 0),
(3, 2, 600, 0),
(3, 3, 1600, 0),
(3, 4, 1400, 0),
(3, 12, 7000, 0),
(3, 13, 8600, 0),
(3, 14, 3100, 0),
(3, 15, 9000, 0),
(4, 7, 1500, 0),
(4, 8, 10000, 0),
(4, 16, 12500, 0),
(4, 17, 15500, 0),
(4, 18, 13250, 0),
(4, 19, 17000, 0),
(4, 20, 8500, 0),
(4, 21, 18900, 0),
(5, 7, 2100, 0),
(6, 10, 14000, 0),
(6, 16, 13000, 0),
(6, 17, 14000, 0),
(6, 18, 14000, 0),
(6, 19, 16000, 0),
(6, 20, 14000, 0),
(6, 21, 17025, 0),
(7, 0, 700, 0),
(8, 3, 1720, 0),
(9, 11, 1600, 0);

insert into Transactions(transaction_id, transaction_datetime) 
values
(0, "2022-01-01 12*30*00"),
(1, "2022-01-01 12*30*00"),
(2, "2022-01-01 12*30*00"),
(3, "2022-01-01 12*30*00"),
(4, "2022-01-01 12*30*00"),
(5, "2022-01-01 12*30*00"),
(6, "2022-09-07 10*32*34"),
(7, "2022-10-02 16*00*00");

insert into TransactionItem(transaction_id, vendor_id, product_id, product_price_rubles, product_price_copecks, product_amount)
values
(0, 0, 0, 1100, 0, 1500),
(0, 0, 1, 500, 0, 700),
(0, 0, 2, 750, 0, 5700),
(0, 0, 9, 5400, 0, 4870),
(1, 3, 3, 1600, 0, 8003),
(1, 3, 4, 1400, 0, 2357),
(2, 6, 10, 14000, 0, 11500),
(3, 2, 5, 3500, 0, 5000),
(3, 2, 6, 3300, 0, 4500),
(4, 4, 8, 10000, 0, 7000),
(4, 4, 7, 1500, 0, 1352),
(5, 9, 11, 1600, 0, 600),
(6, 6, 16, 13000, 0, 20000),
(6, 6, 17, 14000, 0, 18000),
(6, 6, 18, 14000, 0, 24000),
(6, 6, 19, 16000, 0, 6000),
(6, 6, 20, 14000, 0, 4000),
(6, 6, 21, 17025, 0, 10000),
(7, 1, 1, 450, 0, 400);
''')

con.commit()
con.close()